In [2]:
import pandas as pd

In [ ]:
a = pd.Series([1,2,3,4,5],index=['pertamax','b','c','d','e'])

In [ ]:
print(a)

In [ ]:
print(a[['c','e']])

In [ ]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,3,4,5],[4,5,7,5],[6,7,8,9],[7,4,6,5]],columns=['a','b','c','d'])

In [ ]:
print(df)

In [ ]:
print(df.columns)

In [ ]:
print(df['a'])

In [ ]:
print(df[['a','b']])

In [ ]:
print(df[['a','b']].iloc[1])

In [ ]:
print(df[['a','b']].iloc[1:4])

In [ ]:
print(df.shape)

In [ ]:
print(df.values)

In [ ]:
for x in df.values:
    if x[1]>5:
        print(x[1],x[2])

In [20]:
data = []
for x in range(100):
    if(x%2==0):
        data.append([x,x*2,(x*10/2),((x*100)-(x*10/3))])
    else:
        data.append([x,x*6,(x*10/4),((x*560)-(x*10/7))])
df = pd.DataFrame(data)

In [9]:
df

     0    1      2             3
0    0    0    0.0      0.000000
1    1    6    2.5    558.571429
2    2    4   10.0    193.333333
3    3   18    7.5   1675.714286
4    4    8   20.0    386.666667
..  ..  ...    ...           ...
95  95  570  237.5  53064.285714
96  96  192  480.0   9280.000000
97  97  582  242.5  54181.428571
98  98  196  490.0   9473.333333
99  99  594  247.5  55298.571429

[100 rows x 4 columns]

In [6]:
df.shape

(100, 4)

In [10]:
from random import randint,uniform

In [15]:
t = randint(400,450)+(randint(1,999)/1000)
t

410.89

In [16]:
uniform(1,5)

2.518220227120845

In [28]:
data = []
for x in range(100):
    data.append([x,(x*2)*uniform(1,5),(x*10/2)+randint(-10,50),((x*100)-(x*10/3))*uniform(1,2)])
df = pd.DataFrame(data)

In [18]:
print(df)

     0           1      2             3
0    0    0.000000   42.0      0.000000
1    1    4.847111   34.0    167.849355
2    2   15.024016   34.0    244.458896
3    3   10.943981   43.0    353.569734
4    4   38.822339   47.0    491.203017
..  ..         ...    ...           ...
95  95  327.668230  488.0  18318.475100
96  96  423.283386  520.0  10330.403060
97  97  321.155333  514.0  13167.417718
98  98  400.253630  481.0  18488.574140
99  99  217.845232  500.0  11796.868189

[100 rows x 4 columns]

In [34]:
df.describe()

                0           1           2             3
count  100.000000  100.000000  100.000000    100.000000
mean    49.500000  304.396193  266.620000   7368.023708
std     29.011492  227.119011  147.386647   4631.630380
min      0.000000    0.000000   -1.000000      0.000000
25%     24.750000  126.055417  146.750000   3896.876113
50%     49.500000  250.281376  264.000000   6942.890489
75%     74.250000  435.519788  397.500000  11030.356379
max     99.000000  898.342262  524.000000  18677.884620

In [27]:
for x in ['pearson','kendall','spearman']:
    print(x,df.corr(method=x),sep="\n",end="\n\n")

pearson
    0   1   2   3
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN

kendall
     0    1    2    3
0  1.0  NaN  NaN  NaN
1  NaN  1.0  NaN  NaN
2  NaN  NaN  1.0  NaN
3  NaN  NaN  NaN  1.0

spearman
    0   1   2   3
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN

In [25]:
data = []
for x in range(100):
    data.append([1,2,3,4])
df = pd.DataFrame(data)

In [29]:
df.cov()

               0              1              2             3
0     841.666667    5299.607059    4244.323232  1.267580e+05
1    5299.607059   51583.045036   26551.830113  7.871630e+05
2    4244.323232   26551.830113   21722.823838  6.404947e+05
3  126758.004415  787162.963283  640494.739760  2.145200e+07

In [32]:
dfsq = df.diff()

In [33]:
dfsq.describe()

          0           1          2            3
count  99.0   99.000000  99.000000    99.000000
mean    1.0    2.700002   5.000000   188.665501
std     0.0  181.719539  25.903274  2215.046451
min     1.0 -552.817187 -49.000000 -5975.435319
25%     1.0  -62.470897 -13.000000  -677.488718
50%     1.0    4.804617   6.000000   188.925435
75%     1.0   83.830000  22.500000  1199.498811
max     1.0  540.216421  61.000000  5711.826046

In [31]:
df

     0           1      2             3
0    0    0.000000   -1.0      0.000000
1    1    4.655493   11.0    188.925435
2    2   14.297129   48.0    194.679650
3    3    8.662156   59.0    488.647571
4    4   36.480999   10.0    387.357960
..  ..         ...    ...           ...
95  95  619.837151  514.0  13346.125714
96  96  604.020177  471.0   9282.878082
97  97  898.342262  490.0  11495.997666
98  98  605.441056  524.0  13086.373033
99  99  267.300197  494.0  18677.884620

[100 rows x 4 columns]

In [35]:
df.var()

0    8.416667e+02
1    5.158305e+04
2    2.172282e+04
3    2.145200e+07
dtype: float64